[
{"content": "This is the first time I can remember having a pair of shoes that have gotten complements.  They are very attractive (something I really don't care about) and quite comfortable.  The 2E was true to size as most of the Clark's are.  Very please and would buy again.", "star": null, "name": "Sammy"},
{"content": "Let me start by saying I hate to imagine spending a lot of money on dress shoes.  Although I'm a lawyer, I regularly find myself banging into things, walking in messy places outside or in my back yard, and having my kids step on my shoes.  Basically, I am not someone who should have nice shoes.  But I should have Clarks Men's Tilden Walk Oxfords.  These are fantastic.  And by fantastic, I mean they look nice, are very comfortable, and are very reasonably priced for someone who wears dress shoes daily.  I cannot believe how comfortable they are, compared to other dress shoes I have worn.  Rubber sole?  Yes, but how many of us really need wood soles. Did I mention they are very comfortable?  How about price?  For $60, I could buy two or three pairs of these in a year and still come out ahead of some of the fancy shoes I have allowed myself to be tricked into purchasing.  Even if the rubber soles get destroyed, the price tag is still going to leave me out ahead if I replace them in a few months.", "star": null, "name": "Mike & Cindy"},
{"content": "Ooooooooooooo these feel gooooood! My feet are jumping for joy right now. They fit nicely, feel great, no pinching in any areas, woooo good buy! Buy yourself a pair now!", "star": null, "name": "K. B. "},
{"content": "If there was skinny jeans of shoes, these would be them. These shoes are so narrow at the ball and toe of the foot and they don't break in wider. I tried these for 2 days and had to return them because they were so tight. They seem to be well made but the size and shape toe section does not seem to resemble a foot. I am not sure how anyone can fit into these.", "star": "3.0 out of 5 stars", "name": "Coastie"},
{"content": "The shoes feel too narrow and are \"too long\" - they go about 1 inch past the end of my toes. I did not think the shoe looked that \"pointy\" from the picture, but in real life they do, and I dislike pointy shoes. Even though you can return them, there is a $10 restocking charge, and you pay return shipping. So I will wear them instead of returning, but never buy shoes from this vendor again. I've always had a good fit with 9.5 in shoes - until now.", "star": null, "name": "Amazon Customer"},
{"content": "Great style, very comfortable, excellent price. I wear these with my navy/gray suits and get many compliments. The actual color is a little lighter than the picture. Clarks are the way to go, especially when you're on your feet all day!", "star": null, "name": "Hotelier"},
{"content": "My husband returned this shoe for one reason: the toe sticks out more than an inch further than usual for the shoe size.  The shoe felt like it was the correct size and fit, with admirable cushioning.  It was attractive and comfortable.  However the extra length extending from the toe seemed so bizarre and awkward to him that he chose to do a return.  He felt that moving to a smaller size might not fit correctly.  If extra length at the toe does not bother you, this is quite a nice shoe.", "star": "3.0 out of 5 stars", "name": "Colorado Lady"},
{"content": "The shoes look great and feel great but are probably a full size bigger than normal. I got 10.5’s and they’re the same length a friends dress shoes that are 12’s.", "star": null, "name": "Paul"},
{"content": "These dress shoes are awesome. I've gotten plenty of complements on them at work (I'm a teller). I'm constantly walking throughout the day and they feel great. They fit me just fine and I broke them in after a day of use. The insole is very well padded and worked well despite me being very flat footed. The leather top helps it breathe well so no foot odor problems so far. They also slip on fairly easily so that's bonus points for ease of access!", "star": null, "name": "Kevin N."}
]